[
    {
        "id": 1,
        "title": "Portfolio",
        "shortDescEn": "This is a portfolio application to showcase my projects, skills, and experience. It is designed to provide an overview of my professional background and achievements.",
        "shortDescPl": "Aplikacja portfolio służąca do prezentacji moich projektów, umiejętności i doświadczenia. Została zaprojektowana, aby zapewnić przegląd mojego profesjonalnego doświadczenia i osiągnięć.",
        "github1": "https://github.com/PawelSzeliga23/portfolioApp",
        "github2": "",
        "images": [
            "/projects/portfolio1.png"
        ],
        "technologies": [
            "react",
            "TypeScript",
            "tailwindcss"
        ]
    },
    {
        "id": 2,
        "title": "Maze Game",
        "shortDescEn": "Maze is a game created in Pygame, where the player moves through the maze, trying to reach the goal. The game is based on exploration mechanics.",
        "shortDescPl": "Maze to gra stworzona w Pygame, w której gracz porusza się po labiryncie, próbując dotrzeć do celu. Gra opiera się na mechanice eksploracji.",
        "github1": "https://github.com/PawelSzeliga23/pygame",
        "github2": "",
        "images": [
            "/projects/mazegame1.png"
        ],
        "technologies": [
            "Python"
        ]
    },
    {
        "id": 3,
        "title": "Fish Enthusiasts Social Platform - in progress...",
        "shortDescEn": "FishApp is a social platform for fishing enthusiasts. Connect with fellow anglers, share your fishing experiences, and get insights on the best fishing spots.",
        "shortDescPl": "FishApp to platforma społecznościowa dla miłośników wędkarstwa. Połącz się z innymi wędkarzami, dziel się swoimi doświadczeniami wędkarskimi i uzyskaj informacje o najlepszych miejscach do wędkowania.",
        "github1": "https://github.com/PawelSzeliga23/fishSite",
        "github2": "",
        "images": [],
        "technologies": [
            "react",
            "JavaScript",
            "html5"
        ]
    },
    {
        "id": 4,
        "title": "Game project - in progress...",
        "shortDescEn": "Developed with Unreal Engine 5, this project is a isometric game that combines exploration, survival and combat elements. The game is set on a mysterious planet filled with dangerous creatures and challenging environments.",
        "shortDescPl": "Stworzony za pomocą Unreal Engine 5, ten projekt to izometryczna gra łącząca elementy eksploracji, przetrwania i walki. Akcja gry toczy się na tajemniczej planecie pełnej niebezpiecznych stworzeń i wymagających środowisk.",
        "github1": "https://github.com/PawelSzeliga23/Game_project",
        "github2": "",
        "images": [],
        "technologies": [
            "unrealengine"
        ]
    },
    {
        "id": 5,
        "title": "MultiLayerNN",
        "shortDescEn": "This project implements a multilayer neural network (MLP) for classifying handwritten digits using the MNIST dataset. The model is implemented solely with the NumPy library, without using dedicated neural network libraries.",
        "shortDescPl": "Projekt implementuje wielowarstwową sieć neuronową (MLP) do klasyfikacji ręcznie pisanych cyfr przy użyciu zbioru danych MNIST. Model jest zaimplementowany wyłącznie za pomocą biblioteki NumPy, bez użycia dedykowanych bibliotek sieci neuronowych.",
        "github1": "https://github.com/PawelSzeliga23/MultiLayerNN",
        "github2": "",
        "images": [],
        "technologies": [
            "Python"
        ]
    },
    {
        "id": 6,
        "title": "Polish Summits Library - backend",
        "shortDescEn": "Backend application created with ASP.NET Core framework, part of a semester project. The project aims to create a REST API for the Polish Mountain Peaks Library.",
        "shortDescPl": "Aplikacja backendowa stworzona w ramach projektu semestralnego z wykorzystaniem frameworka ASP.NET Core. Celem projektu jest stworzenie REST API dla Polskiej Biblioteki Szczytów Górskich.",
        "github1": "https://github.com/PawelSzeliga23/TIN_project_backend",
        "github2": "",
        "images": [],
        "technologies": [
            "csharp",
            "dotnetcore",
            "microsoftsqlserver"
        ]
    },
    {
        "id": 7,
        "title": "Train simulator",
        "shortDescEn": "A train simulator application developed in Java. It is console-based and allows users to simulate train operations, including managing routes, schedules, and train statuses.",
        "shortDescPl": "Aplikacja symulatora pociągu stworzona w Javie. Jest oparta na konsoli i pozwala użytkownikom symulować operacje pociągów, w tym zarządzanie trasami, rozkładami jazdy i statusami pociągów.",
        "github1": "https://github.com/PawelSzeliga23/ProjektGUI_train_simulator",
        "github2": "",
        "images": [],
        "technologies": [
            "Java"
        ]
    },
    {
        "id": 8,
        "title": "Pacman Game",
        "shortDescEn": "Implementation of the Pacman game in Java using Swing library. The game features classic Pacman mechanics, including maze navigation, pellet collection, and ghost avoidance.",
        "shortDescPl": "Implementacja gry Pacman w Javie z wykorzystaniem biblioteki Swing. Gra zawiera klasyczną mechanikę Pacmana, w tym nawigację po labiryncie, zbieranie kropek i unikanie duchów.",
        "github1": "https://github.com/PawelSzeliga23/ProjektGUI2_pacman_game",
        "github2": "",
        "images": [
            "/projects/pacman1.png"
        ],
        "technologies": [
            "java"
        ]
    },
    {
        "id": 9,
        "title": "Polish Summits Library - frontend",
        "shortDescEn": "A library for managing information about Polish summits.",
        "shortDescPl": "Biblioteka do zarządzania informacjami o polskich szczytach.",
        "github1": "https://github.com/PawelSzeliga23/TIN_projekt_frontend",
        "github2": "https://github.com/PawelSzeliga23/TIN_project_backend",
        "images": [
            "/projects/summitLib1.png"
        ],
        "technologies": [
            "react",
            "JavaScript",
            "html5",
            "css3"
        ]
    }
]